
{
  "start": {
    "north": "hall",
    "text": "The smell of gun-smoke and blood merge as you open your eyes and find yourself in what appears to be a massive crumbling manor. Shattered windows, upended furniture and browned blood stains appear to be the new design motif. You hear gunshots in the distance and a chorus of guttural growls - growls that almost sounded human."
  },
  "hall": {
    "north": "infirmary",
    "south": "start",
    "items": "Walkie Talkie",
    "lookroom": "A broken chandelier is on the floor, glass is littered across the floor. There is a small end table, on it sits a walkie talkie.",
    "lookitem": "An old walkie-talkie. The knobs are missing. A bloody hand-print wraps around it.",
    "message": "A voice cracks over the radio 'HELLO! HELLO! IS ANYONE STILL IN THERE? YOU NEED TO GET OUT, NOW! IT'S LOOSE IN THE MANOR, TOTALLYNOTNEMESIS WAS RELEASED BY THE RAINCOAT CORP. IT'S A NEW ROUND OF TESTING ON HUMAN SUBJECTS. I KNOW THERE'S AT LEAST A SHOTGUN, SHELLS, AND MAYBE THE MAKINGS OF A MOLOTOV COCKTAIL. THE INFIRMARY SHOULD HAVE ADRENALINE. YOU'RE GOING TO NEED IT. GET A WEAPON AND THE ADRENALINE AND GET THE HELL OUT OF THERE!' The message ends.",
    "text": "You look around the hallway you're in, a broken chandelier and shattered glass decorate the marble floor. You see a walkie talkie sitting on a side table. You can continue north or south."
  },
  "infirmary": {
    "west": "kitchen",
    "north": "lab",
    "south": "hall",
    "items": "Adrenaline, Bandages",
    "lookroom": "Bare shelving surrounds the room. Sheets are shredded and are covered in unknown stains. There's a single examination table, tipped over on the floor. Shelving has been pulled slightly away from the wall.",
    "lookitemone": "A cylindrical epi-pen with a cap tightly affixed. 'EPI-PEN' is in block font along the side. ",
    "lookitemtwo": "A roll of white cotton bandages. Edges are frayed but the roll is still intact.",
    "text": "You enter the infirmary. Supplies have been completely wiped from the shelves. The once white sheets were stained and shredded. As you shift through the remnants of supplies, mostly cotton balls and tongue compressors, you find a roll of cotton bandages. Behind a counter you find a box, tucked away, almost as it was hidden. Inside is the adrenaline. What would you like to do? You can continue west, north, or south."
  },
  "kitchen": {
    "north": "library",
    "east": "infirmary",
    "south": "basement",
    "items": "Bottle of Rum",
    "lookroom": "A massive industrial sized kitchen. Cupboards are open and bare. A few cans sit on the counter. On the table is a bottle of rum. A door sits slightly ajar at the far end of the kitchen.",
    "lookitem": "A faded label adorns the bottle. You can barely make out the numbers 151. Able to ID liquor by scent.",
    "text": "More bare shelves in the kitchen. A few cans adorn the shelves, past expiration - even for canned goods. On the table, half a bottle of high-proof rum, covered in dust. What would you like to do? You can move north, east, or south."
  },
  "basement": {
    "north": "kitchen",
    "items": "Rusty Shotgun",
    "lookroom": "You cannot tell how large the basement is due to the dark. It is completely still. You can see an old shotgun resting on one of the last support beams visible before the light from the kitchen disappears",
    "lookitem": "An old pump action shotgun. The barrel is rusted, the forearm and trigger are still functional.",
    "text": "You take a deep breath as you open the door to the basement. The air is cool and damp. Sound exists in a vacuum. You hear nothing. A basement devoid of the sounds of rodents. You quickly survey the basement in the dark. You spot a rusted shotgun leaned against a support beam. What would you like to do? You can move north"
  },
  "library": {
    "east": "lab",
    "south": "kitchen",
    "items": "Lighter, Shotgun Shells",
    "lookroom": "A massive dome shaped room. Heavy drapes are heaped on the floor. Pictures are strewn about the floor. A child's hand outlined and fashioned as a turkey rests on the desk. Next to it, a Zippo lighter. On a shelf behind the desk, a white cardboard box is tucked behind a massive tome. Shotgun shells.",
    "lookitemone": "A black Zippo, appears to be half full. Engraved on the front is an ominous logo, The Raincoat Company.",
    "lookitemtwo": "2 shotgun shells. Standard.",
    "text": "You enter what appears to be a once massive library. Volumes lie tattered on faded and stained intricate rugs. A leather sofa is torn, the sofa filling pouring out, stained with deep brown stains. Old blood. What would you like to do? You can move east, or south."
  },
  "lab": {
    "west": "library",
    "south": "infirmary",
    "lookroom":"Tubing, and IV cables lie on the ground. An observation window is shattered. Shards of glass crunch underfoot.",
    "text": "Something recently happened here. You feel an electricity pulsing through the lab. Your heart rate begins to increase. What would you like to do? You can move west or south."
  }


  }
